Autodesk.Revit.DB.IFCUserDefinedPropertySet.GetProperties
Returns the collection of properties in the property set.
Returns:
The collection of properties in the property set.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.IsPropertyAMemberOfPropertySet(System.String)
Checks whether a property exists in the property set.
propertyName:
The property set name.
Returns:
True if the property exists in the property set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.SetApplicableEntities(System.Collections.Generic.IList{System.String})
Sets the list of IFC entities to which the property set is applicable.
applicableEntities:
The list of IFC entities to which the property set is applicable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.GetApplicableEntities
Returns the list of IFC entities to which the property set is applicable.
Returns:
The list of IFC entities to which the property set is applicable.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.FindPropertyByName(System.String)
Returns property by name.
name:
Name of the property to find.
Returns:
The property or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.ClearPropertySet
Removes all properties from the property set.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.RemoveProperty(System.String)
Removes a property from the property set.
propertyName:
The name of the property to remove.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property with the given name is not present in the property set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.AddProperty(Autodesk.Revit.DB.IFCUserDefinedProperty)
Adds a property to the property set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name already exists in the property set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.IsValidName(Autodesk.Revit.DB.Document,System.String)
Checks whether the proposed name is valid and not exist in the specified document.
Remarks:
Name can't be blank.
If true, the name is valid and not exist in specified document.
If false, the name is not a valid name which means it does not exist in specified document.
document:
The document to check
name:
The name to check.
Returns:
Whether or not the name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.ExportToFile(Autodesk.Revit.DB.Document,System.String)
Export property sets to a text file.
document:
The Revit document.
fileName:
The full text file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.ImportFromFile(Autodesk.Revit.DB.Document,System.String,System.Boolean@)
Import property sets from a text file.
Remarks:
The imported property sets are saved in the document passed as parameter.
document:
The Revit document.
fileName:
The full text file name.
validUserDefinedPropertySetFile:
Whether or not the imported file with property sets is valid.
Returns:
The property set elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCUserDefinedPropertySet.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.ListPropertySetNames(Autodesk.Revit.DB.Document)
Returns a list property set names stored in the document.
document:
The Revit document to retrieve names from.
Returns:
The list of property set names.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.CopyPropertySet(Autodesk.Revit.DB.Document,System.String)
Create copy of property set with new name.
Remarks:
The copied property set is saved in the document passed as parameter.
Passing the same document as the source property set's document will create a new property set in the same document.
document:
The Revit document to save the copied property set.
copyPropertySetName:
The name for copied property set name.
Returns:
The copied property set element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name is empty or already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCUserDefinedPropertySet element.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.FindPropertySetByName(Autodesk.Revit.DB.Document,System.String)
Returns property set element by name.
document:
The document to find the property set with the specified name.
name:
Name of the property set to find.
Returns:
The property set element, or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.Create(Autodesk.Revit.DB.Document,System.String)
Create an IFC user-defined property set with default values.
document:
The document where created property set is saved.
name:
The name specified to this property set.
Returns:
The new property set instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name is empty or already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet.PropertySetType
The user-defined property set type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySet
Represents an element that contains an IFC user-defined property set stored in a Revit document.
Since:
2027